{
  "egypt_symbol_notes": {
    "bow": "Warfare and hunting tool; often a phonogram (q/p/k depending on context) and a determinative for martial power, subjugation, or protection.",
    "hoe": "Agricultural implement tied to cultivation and ritual ‘preparation’; used as a determinative and phonetic sign.",
    "god_figure": "Anthropomorphic marker indicating divine agency; commonly a determinative for deities.",
    "bread": "Offering loaf symbolizing food and sustenance; phonetic value 't'.",
    "feather": "Represents the concepts of truth and balance; phonetic value 'm'.",
    "eye": "Wedjat eye symbolizing protection and healing; phonetic for 'ir' or 'jr'.",
    "owl": "Common phonogram 'm'; also signifies night and hidden knowledge.",
    "reed": "Symbol for writing and speech; phonetic and determinative use.",
    "scribe_tools": "Represents writing, record-keeping, and administration.",
    "leg": "Indicates motion, going forth, phonetic sign.",
    "lizard": "Represents reptiles; associated with protective symbolism.",
    "woman_seated": "Determinative for female persons or roles.",
    "jar": "Associated with offerings, fluids, and ritual context.",
    "crown": "Symbol of royal authority and divine power.",
    "man_seated": "Determinative for male persons or generic agents."
  },
  
  "greek_symbol_notes": {
  "Κ": "Kappa: Tenth letter, consonant /k/ sound, equivalent to Latin C/K.",
  "γ": "Lowercase gamma, consonant /g/ sound, or nasal /ng/ before γ, κ, χ, ξ sounds.",
  "ι": "Lowercase iota, vowel /i/ sound, can form diphthongs with other vowels.",
  "Ν": "Nu: Thirteenth letter, consonant /n/ sound, nasal consonant with grammatical functions.",
  "Τ": "Tau: Nineteenth letter, consonant /t/ sound, common in grammatical endings.",
  "ο": "Lowercase omicron, short vowel /o/ sound, frequent in grammatical morphemes.",
  "λ": "Lowercase lambda, consonant /l/ sound, liquid consonant with metrical significance.",
  "θ": "Lowercase theta, aspirated /tʰ/ sound, distinguishes words from similar tau forms.",
  "υ": "Lowercase upsilon, vowel /y/ sound, forms diphthongs and appears in many endings.",
  "Θ": "Theta: Eighth letter, aspirated /tʰ/ sound in ancient Greek, /θ/ (voiceless th) in modern.",
  "Η": "Eta: Seventh letter, long vowel /ē/ sound in ancient Greek, /i/ in modern Greek.",
  "ς": "Lowercase sigma (final form), consonant /s/ sound, used only at word endings.",
  "ε": "Lowercase epsilon, short vowel /e/ sound, appears frequently in verb conjugations.",
  "-": "Hyphen; marks word division or compound elements in Greek texts.",
  "Ὶ": "Capital Iota with grave accent, indicates lowered pitch or unstressed position.",
  "ῖ": "Lowercase iota with circumflex accent, indicates falling tone on long vowel /ī/.",
  "ί": "Lowercase iota with acute accent, vowel /i/ with raised pitch indicating word stress.",
  "Ἰ": "Capital Iota with smooth breathing, vowel /i/ without initial aspiration.",
  "Ἑ": "Capital Epsilon with rough breathing, indicates /h/ sound before vowel.",
  "'": "Apostrophe; indicates elision (omitted vowel) or contraction in Greek.",
  "Π": "Pi: Sixteenth letter, consonant /p/ sound, appears in mathematical and scientific contexts.",
  "Ο": "Omicron: Fifteenth letter, short vowel /o/ sound, distinct from omega (long o).",
  "Μ": "Mu: Twelfth letter, consonant /m/ sound, nasal consonant often used in word formation.",
  "[": "Opening square bracket; typically editorial reconstructions or uncertain readings.",
  "Α": "Alpha: First letter of Greek alphabet, vowel /a/ sound, often marks beginnings or primacy.",
  "μ": "Lowercase mu, consonant /m/ sound, nasal consonant often in prefixes and roots.",
  "ὲ": "Lowercase epsilon with grave accent, short /e/ sound with lowered pitch.",
  "Ᾱ": "Capital Alpha with macron (long mark), indicates long /ā/ vowel quantity.",
  "Γ": "Gamma: Third letter, consonant /g/ sound, or /ng/ before γ, κ, χ, ξ sounds.",
  "Υ": "Upsilon: Twentieth letter, vowel /y/ sound in ancient Greek, /i/ in modern pronunciation.",
  "(": "Opening parenthesis; editorial or explanatory insertions.",
  ")": "Closing parenthesis; completes editorial or explanatory insertions.",
  "ω": "Lowercase omega, long vowel /ō/ sound, often in verb endings and declensions.",
  "ῑ": "Lowercase iota with macron, explicitly marks long vowel quantity /ī/.",
  "·": "Middle dot (Greek semicolon); equivalent to modern semicolon, marks major pause.",
  "ῐ": "Lowercase iota with breve, explicitly marks short vowel quantity /ĭ/.",
  "Ξ": "Xi: Fourteenth letter, consonant cluster /ks/ sound, compound sound written as single letter.",
  "ν": "Lowercase nu, consonant /n/ sound, assimilates before consonants in pronunciation.",
  "Ε": "Epsilon: Fifth letter, short vowel /e/ sound, distinct from eta (long e).",
  "η": "Lowercase eta, long vowel /ē/ sound in ancient Greek, /i/ in modern pronunciation.",
  "]": "Closing square bracket; completes editorial reconstructions.",
  "Ι": "Iota: Ninth letter, vowel /i/ sound, can form diphthongs with other vowels.",
  "κ": "Lowercase kappa, consonant /k/ sound, common in word formation and inflection.",
  "1": "Numeral one; manuscript numbering, line numbers, or verse citations.",
  "ῃ": "Lowercase eta with iota subscript, indicates original diphthong /ēi/ sound.",
  "ψ": "Lowercase psi, consonant cluster /ps/ sound, compound phoneme as single letter.",
  "ἢ": "Lowercase eta with rough breathing and grave accent, aspirated long vowel with lowered tone.",
  "Ὗ": "Capital Upsilon with rough breathing and circumflex, indicates aspiration and falling tone.",
  "Ἱ": "Capital Iota with rough breathing, vowel /i/ with initial aspiration /h/.",
  "Ᾰ": "Capital Alpha with breve (short mark), indicates short /ă/ vowel quantity.",
  "Ί": "Capital Iota with acute accent, indicates raised pitch or primary word stress.",
  "Λ": "Lambda: Eleventh letter, consonant /l/ sound, liquid consonant in Greek phonology.",
  "\"": "Quotation mark; marks direct speech or citations in Greek texts.",
  "σ": "Lowercase sigma (medial form), consonant /s/ sound, used within words.",
  "Ἡ": "Capital Eta with rough breathing, long /ē/ sound with initial aspiration /h/.",
  "Χ": "Chi: Twenty-second letter, aspirated /kʰ/ sound in ancient Greek, /x/ (voiceless velar fricative) in modern.",
  "ζ": "Lowercase zeta, consonant cluster /zd/ sound, represents compound phoneme.",
  "Ἷ": "Capital Iota with rough breathing and circumflex accent, complex tonal marking.",
  "ὶ": "Lowercase iota with grave accent, vowel /i/ with lowered pitch or unstressed.",
  "ἰ": "Lowercase iota with smooth breathing, vowel /i/ without initial aspiration.",
  "α": "Lowercase alpha, vowel /a/ sound, fundamental vowel in Greek phonology.",
  ",": "Comma; punctuation for pauses, lists, or grammatical separation.",
  "ᾗ": "Lowercase eta with rough breathing, circumflex accent, and iota subscript, complex phonetic marking.",
  "τ": "Lowercase tau, consonant /t/ sound, appears in many grammatical suffixes.",
  "<": "Less-than symbol; editorial mark for textual corrections or variants.",
  "Σ": "Sigma: Eighteenth letter, consonant /s/ sound, has special final form (ς) at word end.",
  "ρ": "Lowercase rho, consonant /r/ sound, when word-initial requires rough breathing mark.",
  "ἡ": "Lowercase eta with rough breathing, long /ē/ sound with initial /h/.",
  "Ω": "Omega: Twenty-fourth letter, long vowel /ō/ sound in ancient Greek, /o/ in modern.",
  ".": "Period (full stop); marks end of sentences in Greek texts.",
  "Ῥ": "Capital Rho with rough breathing, indicates /hr/ sound at word beginning (all word-initial rhos are aspirated).",
  "ἕ": "Lowercase epsilon with rough breathing and acute accent, aspirated short vowel with raised tone.",
  "ῆ": "Lowercase eta with circumflex accent, falling tone on long vowel /ē/.",
  "Ἶ": "Capital Iota with smooth breathing and circumflex accent, vowel /ī/ with falling tone, no initial aspiration.",
  "β": "Lowercase beta, consonant /b/ sound in ancient Greek, /v/ sound in modern Greek pronunciation.",
  "Ὁ": "Capital Omicron with rough breathing, short /o/ sound with initial aspiration /h/.",
  "Ϊ": "Capital Iota with diaeresis (trema), indicates /i/ vowel pronounced separately, not as diphthong.",
  "Φ": "Phi: Twenty-first letter, aspirated /pʰ/ sound in ancient Greek, /f/ in modern pronunciation.",
  "ῗ": "Lowercase iota with diaeresis and circumflex, /ī/ vowel with falling tone, pronounced separately.",
  "έ": "Lowercase epsilon with acute accent (modern Greek), short /e/ sound with stress marking.",
  "ἷ": "Lowercase iota with rough breathing and circumflex accent, aspirated /ī/ vowel with falling tone."

}
,
  "latin_symbol_notes": {
    "꜠": "Modifier letter for stress and high tone, used in phonetic transcription and transliteration.",
    "꜡": "Modifier letter for stress and low tone, common in linguistic notation.",
    "Ꜣ": "Capital Letter Egyptological Alef, used in transliterating Egyptian hieroglyphs.",
    "ꜣ": "Small Letter Egyptological Alef, counterpart to capital version.",
    "Ꜥ": "Capital Letter Egyptological Ain, reflecting voiced pharyngeal sounds in transliteration.",
    "ꜥ": "Small Letter Egyptological Ain, used in Semitic transliterations.",
    "Ꝁ": "Capital Letter K with Stroke, scribal abbreviation mark for legal or medieval texts.",
    "ꝁ": "Small Letter K with Stroke, similar abbreviation symbol.",
    "ꝑ": "Small Letter P with Stroke Through Descender, abbreviation of 'per' in medieval Latin manuscripts.",
    "ꝛ": "Small Letter R Rotunda, a stylistic medieval form of 'r' to save space.",
    "Ꞁ": "Capital Letter Turned L, used in paleography to denote variant forms.",
    "ꞁ": "Small Letter Turned L, lowercase variant in medieval scripts.",
    "Ꞃ": "Capital Letter Insular R, found in Insular script manuscripts in medieval Britain and Ireland.",
    "Ꝼ": "Capital Letter Insular F, distinct letter in Celtic Insular manuscripts.",
    "ꟽ": "Epigraphic Letter Inverted M, used as a logogram for 'mulier' or 'matrona' in Roman inscriptions.",
    "ꟿ": "Epigraphic Letter Archaic M, represents the praenomen 'Manius' in inscriptions."
  },"cuneiform_symbol_notes": {
    "𒀀": "Cuneiform sign A: vowel sound /a/ in Sumerian and Akkadian, fundamental vowel marker",
    "𒀭": "Cuneiform sign AN/DINGIR: divine determinative, heaven, god concept in religious texts",
    "𒈗": "Cuneiform sign LUGAL: king, ruler, sovereign used in royal inscriptions and titles",
    "𒊕": "Cuneiform sign UD: day, sun, light, time marker in calendrical and chronological contexts",
    "𒄿": "Cuneiform sign I: vowel /i/, often used in verbal forms and grammatical particles",
    "𒂍": "Cuneiform sign E: house, temple, building in architectural and religious contexts",
    "𒀸": "Cuneiform sign ARAD: servant, slave, worker in administrative and legal documents",
    "𒁹": "Cuneiform sign DIRIG: to exceed, surplus, extra in mathematical and accounting texts",
    "𒉋": "Cuneiform sign TI: life, to live, arrow in medical, military, and philosophical contexts",
    "𒆠": "Cuneiform sign KI: earth, place, land in geographical and territorial designations",
    "𒌓": "Cuneiform sign ZU: to know, knowledge, wisdom in educational and scribal contexts",
    "𒈨": "Cuneiform sign ME: divine powers, cultural practices in mythological and religious texts",
    "𒉿": "Cuneiform sign TUKU: to have, possess, hold in commercial and legal transactions",
    "𒄩": "Cuneiform sign HA: fish, to catch in texts about fishing, food, and economy",
    "𒁇": "Cuneiform sign DU: to go, walk, build in construction, travel, and action contexts",
    "lugal": "ATF: lugal - Sumerian/Akkadian for 'king', royal title in administrative texts",
    "an": "ATF: an - Sky god An/Anu, heaven concept in religious and mythological contexts",
    "ki": "ATF: ki - Earth, place, land in geographical and cosmological descriptions",
    "dingir": "ATF: dingir - God, divine being, deity in religious and ceremonial texts",
    "sar": "ATF: sar - To write, inscription, totality in scribal and administrative contexts",
    "{d}": "ATF: determinative for divine names, indicates following word refers to a deity"
  },
  "cuneiform_hint": "Cuneiform signs represent syllables, words, or concepts in ancient Mesopotamian languages (Sumerian, Akkadian, Hittite, etc.). ATF format uses Latin transliteration of cuneiform symbols.",
  "greek_hint": "If no specific character note is found, treat as lexical marker considering diacriticals (breathing marks, accents, vowel quantity) which affect pronunciation, meaning, and grammatical function in ancient Greek texts.",
  "latin_hint": "Letters and symbols reflect phonetic values and scribal practices in manuscripts."
}

